Repository: DevelopCubeLab/BatteryInfo
Catalog: BatteryInfo/Localizable.xcstrings
Source language: en
Languages: es_es, zh_hans

source: About
es_es: Acerca de
zh_hans: 关于

source: Accessory Current Capacity: %@%%
es_es: Capacidad actual del accesorio: %@%%
zh_hans: 配件电池电量: %@%%

source: Accessory Details
es_es: Detalles del accesorio
zh_hans: 配件信息

# AccessoryExternalConnected
source: Accessories connected to charger: %@
es_es: Accesorios conectados al cargador: %@
zh_hans: 配件已连接电源: %@

# AccessoryIsCharging
source: Accessory charging status: %@
es_es: Estado de carga del accesorio: %@
zh_hans: 配件充电状态: %@

source: Alert
es_es: Alerta
zh_hans: 提示

source: All Data
es_es: Todos los datos
zh_hans: 全部数据

source: Automatic
es_es: Automático
zh_hans: 自动

# AutoRefreshDataFooterMessage
source: The app will not refresh and record data when it is in the background, and it will not consume battery power in the background.
es_es: La aplicación no actualizará ni registrará datos cuando esté en segundo plano, y no consumirá energía de la batería en segundo plano.
zh_hans: App不会在后台时刷新和记录数据，并且不会在后台消耗电池电量

# AutoRefreshDataViewSetting
source: Schedule battery data refresh
es_es: Programar actualización de datos de batería
zh_hans: 定时刷新电池数据

source: Available Groups
es_es: Grupos disponibles
zh_hans: 可显示在首页的信息组

source: Average Temperature: %@℃
es_es: Temperatura media: %@℃
zh_hans: 平均温度: %@℃

# BatteryChargeNormal
source: Battery charge status is normal
es_es: El estado de carga de la batería es normal
zh_hans: 电池充电状态正常

# BatteryDataRecordsCSVName
source: BatteryDataRecords
es_es: RegistrosDatosBateria
zh_hans: 电池历史数据记录

# BatteryDataSourceMessage
source: Battery data source is from %@ Update time: %@
es_es: Fuente de datos de la batería: %@ Hora de actualización: %@
zh_hans: 电池数据来源于%@ 数据刷新时间: %@

source: Battery fully charged
es_es: Batería completamente cargada
zh_hans: 电池已充满

# BatteryHistorySummaryContent
source: Total Records: %@ items Recorded over %@ days Battery Health Change: %@%% Capacity Change: %@ mAh Recorded maximum capacity: %@ mAh Recorded minimum capacity: %@ mAh Cycle Count Increase: %@ time(s) Avg. Cycles per Day: %@ time(s)
es_es: Total de registros: %@ elementos Registrado durante %@ días Cambio en la salud de la batería: %@%% Cambio de capacidad: %@ mAh Capacidad máxima registrada: %@ mAh Capacidad mínima registrada: %@ mAh Aumento del contador de ciclos: %@ veces Prom. de ciclos por día: %@ veces
zh_hans: 总记录数: %@条 累计记录%@天 电池健康度变化: %@%% 电池容量变化: %@ mAh 记录中最高容量: %@ mAh 记录中最低容量: %@ mAh 循环次数增加: %@次 平均每日循环次数: %@次

source: Battery Installed: %@
es_es: Batería instalada: %@
zh_hans: 电池已安装: %@

# BatteryLifeTime
source: Battery LifeTime Data
es_es: Datos de vida útil de la batería
zh_hans: 电池生命周期数据

# BatteryLifeTimeTotalOperatingTime
source: Battery Total Operating Time: %@ hours
es_es: Tiempo total de funcionamiento de la batería: %@ horas
zh_hans: 电池总工作时间: %@小时

source: Battery Manufacturer: %@
es_es: Fabricante de la batería: %@
zh_hans: 制造商: %@

source: Battery overheating
es_es: Sobrecalentamiento de la batería
zh_hans: 电池温度过高

# BootVoltage
source: Boot Voltage: %@V
es_es: Voltaje de arranque: %@V
zh_hans: 开机电压: %@V

# CalculatedChargingPower
source: Calculated Charging Power: %@W
es_es: Potencia de carga calculada: %@W
zh_hans: 计算充电功率: %@W

source: Cancel
es_es: Cancelar
zh_hans: 取消

source: Ceiling
es_es: Redondeo por exceso
zh_hans: 向上取整

# CFBundleDisplayName
source: Battery Info
es_es: Info Batería
zh_hans: 电池信息

# ChargeDescription
source: Charge Type: %@
es_es: Protocolo de carga: %@
zh_hans: 当前充电协议: %@

# ChargeInfo
source: Charge Information
es_es: Información de carga
zh_hans: 充电信息

# ChargeInfoFooterMessage
source: The charging power data is for reference only, please take the data from the power measurement device as the standard.
es_es: Los datos de potencia de carga son solo de referencia, tome los datos del dispositivo de medición de potencia como estándar.
zh_hans: 充电功率数据仅供参考，数据并非充电器输出实际功率，请以功率测量设备数据为准

source: Charger Firmware Version: %@
es_es: Versión de firmware del cargador: %@
zh_hans: 充电器固件版本: %@

source: Charger Hardware Version: %@
es_es: Versión de hardware del cargador: %@
zh_hans: 充电器硬件版本: %@

source: Charger Info
es_es: Información del cargador
zh_hans: 充电器信息

source: Charger Manufacturer: %@
es_es: Fabricante del cargador: %@
zh_hans: 充电器制造商: %@

source: Charger Model: %@
es_es: Modelo del cargador: %@
zh_hans: 充电器型号: %@

source: Charger Name: %@
es_es: Nombre del cargador: %@
zh_hans: 充电器名称: %@

# ChargerNameInfoFooterMessage
source: The charger information is for reference only. If you connect a charger without a name after connecting a charger with a name, the charger name still displays the previous charger name. This may be a system bug, and the device can return to normal after a restart.
es_es: La información del cargador es solo de referencia. Si conecta un cargador sin nombre después de conectar uno con nombre, el nombre del cargador seguirá mostrando el nombre del cargador anterior. Esto puede ser un error del sistema y el dispositivo puede volver a la normalidad después de un reinicio.
zh_hans: 充电器信息仅供参考，如果您在连接带有名称的充电器后连接不带名称的充电器，充电器名称仍然显示之前的充电器名称，这可能是系统的bug，重启设备后可恢复正常

source: Charging
es_es: Cargando
zh_hans: 充电中

# ChargingCurrent
source: Charging Current: %@A
es_es: Corriente de carga: %@A
zh_hans: 充电电流: %@A

# ChargingVoltage
source: Charging Voltage: %@V
es_es: Voltaje de carga: %@V
zh_hans: 充电电压: %@V

# CharingFull
source: Full
es_es: Completa
zh_hans: 已充满

source: Close
es_es: Cerrar
zh_hans: 关闭

source: Confirm
es_es: Confirmar
zh_hans: 确定

source: Connected
es_es: Conectado
zh_hans: 已连接

source: Copy
es_es: Copiar
zh_hans: 复制

source: Copy all data
es_es: Copiar todos los datos
zh_hans: 复制全部信息

source: Copy Successful
es_es: Copiado con éxito
zh_hans: 复制成功

source: Current Capacity: %@%%
es_es: Capacidad actual: %@%%
zh_hans: 当前电池电量: %@%%

# CurrentRAWCapacity
source: Current Real-time Capacity: %@ mAh
es_es: Capacidad en tiempo real: %@ mAh
zh_hans: 当前实时容量: %@ mAh

source: Current Temperature: %@℃
es_es: Temperatura actual: %@℃
zh_hans: 当前电池温度: %@℃

# CurrentUseOption
source: Currently used opention: %@
es_es: Protocolo en uso: %@
zh_hans: 当前使用的协议: %@

# CurrentVoltage
source: Current Voltage: %@V
es_es: Voltaje actual: %@V
zh_hans: 当前电压: %@V

source: Cycle Count: %@
es_es: Número de ciclos: %@
zh_hans: 循环次数: %@次

# DataChanged
source: When Data Changed
es_es: Cuando cambian los datos
zh_hans: 数据变化时

# DataRecordSettings
source: Data Record
es_es: Registro de datos
zh_hans: 电池数据记录

source: %@ days
es_es: %@ días
zh_hans: %@天

source: Delete
es_es: Eliminar
zh_hans: 删除

source: Delete All Records
es_es: Eliminar todos los registros
zh_hans: 删除全部记录

# DeleteAllRecordsMessage
source: This operation deletes all history records, and the operation is irreversible
es_es: Esta operación elimina todos los registros del historial y es irreversible.
zh_hans: 此操作会删除所有历史记录，此操作不可逆

# DeleteAllRecordsTitle
source: Are you sure you want to delete all the records data?
es_es: ¿Seguro que quieres eliminar todos los datos de los registros?
zh_hans: 确定要删除所有数据吗？

# DeleteRecordMessage
source: Confirm to delete this record?
es_es: ¿Confirmas la eliminación de este registro?
zh_hans: 确认删除这条记录吗？

# DesignCapacity
source: Design Capacity: %@ mAh
es_es: Capacidad de diseño: %@ mAh
zh_hans: 设计容量: %@ mAh

# DeviceUptime
source: Device uptime: %d days %d hours %d minutes
es_es: Tiempo de actividad del dispositivo: %d días %d horas %d minutos
zh_hans: 设备已启动：%d天 %d小时 %d分钟

source: Dismiss
es_es: Descartar
zh_hans: 关闭

source: Displayed Home Groups
es_es: Grupos mostrados en inicio
zh_hans: 首页显示的信息组

# DisplayedHomeGroupsFooterMessage
source: Information groups containing * need to be displayed under specific conditions.
es_es: Los grupos de información que contienen * deben mostrarse bajo condiciones específicas.
zh_hans: 包含*的信息组需要在特定条件下显示

# DisplayGeneralSettingsFooterMessage
source: 'Use history records to calculate the battery health refresh date in the settings’Enable Record history records' function to be enabled.
es_es: Para usar la función 'Calcular fecha de actualización de salud de batería en ajustes con historial', es necesario activar 'Habilitar registro de historial'.
zh_hans: '使用历史记录来推算设置中的电池健康数据刷新日期'功能需要开启'记录历史记录'功能

source: Display Settings
es_es: Ajustes de visualización
zh_hans: 显示

# DoubleClickTabBarButtonToScrollToTop
source: Double clicking the bottom button on the homepage to return the list to the top
es_es: Doble clic en el botón inferior de la página de inicio para volver al principio de la lista
zh_hans: 双击首页底部按钮让列表返回顶部

source: Enable
es_es: Habilitar
zh_hans: 启用

# EnableHistoryStatistics
source: History Records Statistics
es_es: Estadísticas de registros del historial
zh_hans: 历史记录统计

source: Every Day
es_es: Cada día
zh_hans: 每天

source: Export all records to CSV
es_es: Exportar todos los registros a CSV
zh_hans: 将所有记录导出到CSV

source: Floor
es_es: Redondeo por defecto
zh_hans: 向下取整

# ForceShowChargingData
source: Charging data is still displayed when uncharged
es_es: Mostrar datos de carga incluso sin estar cargando
zh_hans: 在未充电的状态下仍然显示充电数据

# GroupAccessoryDetails
source: Accessory Details Group*
es_es: Grupo Detalles del accesorio*
zh_hans: 外接配件信息*

# GroupBasic
source: Battery Basic Info group
es_es: Grupo Información básica de batería
zh_hans: 电池基础信息

# GroupBatteryLifeTime
source: Battery LifeTime Info group
es_es: Grupo Información de vida útil de batería
zh_hans: 电池生命周期信息

# GroupBatteryQmax
source: Battery Qmax Info group
es_es: Grupo Información Qmax de batería
zh_hans: 电池Qmax信息

# GroupBatterySerial
source: Battery Serial Number Info group
es_es: Grupo Información número de serie de batería
zh_hans: 电池序列号信息

# GroupBatteryVoltage
source: Battery Voltage Info group
es_es: Grupo Información voltaje de batería
zh_hans: 电池电压信息

# GroupCharge
source: Charge Info group
es_es: Grupo Información de carga
zh_hans: 充电信息

# GroupCharger
source: Charger Info group
es_es: Grupo Información del cargador
zh_hans: 充电器信息

# GroupChargingPowerNotChargeReason
source: Charging Power and Not Charging Reason Group*
es_es: Grupo Potencia de carga y motivo de no carga*
zh_hans: 充电功率和不充电原因*

# GroupNotChargeReason
source: Not Charge Reason Info*
es_es: Información motivo de no carga*
zh_hans: 电池未充电原因*

# GroupSettingsBatteryInfo
source: Settings Battery Info group*
es_es: Grupo Información de batería en Ajustes*
zh_hans: 设置中的电池信息*

# GroupUnknown
source: Unknown Group
es_es: Grupo desconocido
zh_hans: 未知

source: History
es_es: Historial
zh_hans: 历史记录

# HistoryRecordViewInHomeView
source: Display the history record view on the home view
es_es: Mostrar vista de historial en la pantalla de inicio
zh_hans: 在主界面显示历史记录界面

# HistoryStatistics
source: History Records Statistics
es_es: Estadísticas de registros del historial
zh_hans: 历史记录统计

# InstantAmperage
source: Instant Current: %@mA
es_es: Corriente instantánea: %@mA
zh_hans: 实时电流: %@mA

# IsCharging
source: Charging status: %@
es_es: Estado de carga: %@
zh_hans: 充电状态: %@

# KeepOriginal
source: Keep original value
es_es: Mantener valor original
zh_hans: 原始数据

source: Language Settings
es_es: Ajustes de idioma
zh_hans: 界面语言

# LimitVoltage
source: Limit Voltage: %@V
es_es: Voltaje límite: %@V
zh_hans: 限制电压: %@V

source: MagSafe Battery Pack
es_es: Batería MagSafe
zh_hans: MagSafe 外接电池

source: Manual Add Record
es_es: Añadir registro manualmente
zh_hans: 添加记录

# ManufacturerDataSourceMessage
source: Click the serial number to hide the display. Battery manufacturer information comes from the Internet and is calculated through serial number information. If there are any errors, please submit them for correction and improvement.
es_es: Haz clic en el número de serie para ocultarlo. La información del fabricante de la batería proviene de Internet y se calcula a través de la información del número de serie. Si hay errores, envíalos para su corrección y mejora.
zh_hans: 点击序列号可以隐藏显示，电池制造商信息来源于网络，通过序列号信息进行推算，如有错误请提出以进行更正和改进

source: Maximum Capacity: %@%%
es_es: Salud de la batería: %@%%
zh_hans: 健康度: %@%%

source: Maximum Capacity Accuracy
es_es: Precisión de la salud de la batería
zh_hans: 电池健康度精准度

# MaximumChargeCurrent
source: Maximum Charge Current: %@mA
es_es: Corriente máxima de carga: %@mA
zh_hans: 最大充电电流: %@mA

# MaximumChargingHandshakeWatts
source: Maximum charging handshake watts: %@W
es_es: Potencia máxima de negociación de carga: %@W
zh_hans: 最大充电握手功率: %@W

# MaximumDischargeCurrent
source: Maximum Discharge Current: %@mA
es_es: Corriente máxima de descarga: %@mA
zh_hans: 最大放电电流: %@mA

# MaximumPackVoltage
source: Maximum Battery Pack Voltage: %@V
es_es: Voltaje máximo del paquete de batería: %@V
zh_hans: 电池组最大电压: %@V

# MaximumQmax
source: Maximum Qmax: %@ mAh
es_es: Qmax máximo: %@ mAh
zh_hans: 最大Qmax: %@ mAh

source: Maximum Temperature: %@℃
es_es: Temperatura máxima: %@℃
zh_hans: 最高温度: %@℃

# MinimumPackVoltage
source: Minimum Battery Pack Voltage: %@V
es_es: Voltaje mínimo del paquete de batería: %@V
zh_hans: 电池组最小电压: %@V

# MinimumQmax
source: Minimum Qmax: %@ mAh
es_es: Qmax mínimo: %@ mAh
zh_hans: 最小Qmax: %@ mAh

source: Minimum Temperature: %@℃
es_es: Temperatura mínima: %@℃
zh_hans: 最低温度: %@℃

# NeedRunTimePermissionMessage
source: Lacking the necessary rights, data cannot be accessed. If you are using iOS or iPad OS to install, please do so in a jailbroken or TrollStore environment. If you do not have the permissions, the App will not be able to access more battery information. In future versions, you may be able to use it with restricted permissions, but in the current version, you must have the 'IOPMPowerSourceClient' rights.
es_es: Faltan los permisos necesarios, no se puede acceder a los datos. Si está utilizando iOS o iPadOS para instalar, hágalo en un entorno con jailbreak o TrollStore. Sin los permisos, la App no podrá acceder a más información de la batería. En futuras versiones, es posible que pueda usarla con permisos restringidos, but en la versión actual, debe tener los permisos 'IOPMPowerSourceClient'.
zh_hans: 缺少必要的权利，所以无法获取数据，如果您使用iOS或者iPad OS安装，请在越狱或TrollStore环境下进行安装，如果没有权限，App将无法获取更多电池信息。在未来的版本中您或许可以在权限受限的情况下使用，但是当前版本您必须拥有’IOPMPowerSourceClient’权利。

# NegotiatingWithCharger
source: Negotiating with the charger
es_es: Negociando con el cargador
zh_hans: 正在与充电器握手功率

# NoRecord
source: No any record
es_es: Ningún registro
zh_hans: 没有记录

source: Not Charging
es_es: No está cargando
zh_hans: 未充电

source: Not Charging Reason: %@
es_es: Motivo por el que no carga: %@
zh_hans: 电池未充电原因: %@

source: Not Connected
es_es: No conectado
zh_hans: 未连接

# NotEnoughData
source: Not enough data to generate statistics.
es_es: No hay suficientes datos para generar estadísticas.
zh_hans: 数据不足，无法生成统计数据。

source: <Not Included>
es_es: <No incluido>
zh_hans: <未包含>

source: Optimized Battery Charging
es_es: Carga optimizada de la batería
zh_hans: 优化电池充电

source: Possible Refresh Date: %@
es_es: Posible fecha de actualización: %@
zh_hans: 预估刷新日期: %@

# PowerOptionDetail
source: Option %d: %@V %@A
es_es: Opción %d: %@V %@A
zh_hans: 协议 %d: %@V %@A

# PowerOptions
source: Charger available options: %@
es_es: Opciones disponibles del cargador: %@
zh_hans: 充电器可用充电档位: %@

# ProviderIOKit
source: device IOKit
es_es: IOKit del dispositivo
zh_hans: 设备IOKit

source: Raw Data
es_es: Datos brutos
zh_hans: 原始数据

# RawDataCopySuccessfulMessage
source: Successful copy of the raw data
es_es: Copia de datos brutos exitosa
zh_hans: 原始数据复制成功

source: Record Create Date: %@
es_es: Fecha de creación del registro: %@
zh_hans: 记录日期: %@

source: Record frequency settings
es_es: Ajustes de frecuencia de registro
zh_hans: 记录频率设置

source: Record show 'Design Capacity'
es_es: Mostrar 'Capacidad de diseño' en el registro
zh_hans: 记录中显示'设计容量'

# RemainingCapacity
source: Remaining Capacity: %@ mAh
es_es: Capacidad restante: %@ mAh
zh_hans: 剩余容量: %@ mAh

source: Reset Displayed Home Groups
es_es: Restablecer grupos mostrados en inicio
zh_hans: 重设首页显示的信息组

# ResetDisplayedHomeGroupsMessage
source: Are you sure you want to reset the information group displayed on the homepage? This operation will reset the information group displayed on the homepage to the default sorting.
es_es: ¿Seguro que quieres restablecer el grupo de información mostrado en la página de inicio? Esta operación restablecerá el grupo de información mostrado en la página de inicio al orden predeterminado.
zh_hans: 确定重置首页显示的信息组吗？此操作会重置首页显示的信息组为默认的排序

source: Round
es_es: Redondeo
zh_hans: 四舍五入

source: Serial Number: %@
es_es: Número de serie: %@
zh_hans: 序列号: %@

source: Settings
es_es: Ajustes
zh_hans: 设置

# SettingsBatteryInfo
source: Battery information in ‘Settings’
es_es: Información de batería en 'Ajustes'
zh_hans: 设置中的电池健康数据

# SettingsBatteryInfoFooterMessage
source: The battery health data in the settings is not generated in real time; the App reads cached data, and the data is for reference only.
es_es: Los datos de salud de la batería en los ajustes no se generan en tiempo real; la App lee datos almacenados en caché, y los datos son solo de referencia.
zh_hans: 设置中的电池健康数据不是实时生成，App读取的是缓存数据，仅供参考

# ShowCPUFrequency
source: Show CPU Frequency in Home
es_es: Mostrar frecuencia de CPU en inicio
zh_hans: 在首页显示CPU频率

# ShowSettingsBatteryInfo
source: Show in Settings Battery Info
es_es: Mostrar en Información de batería de Ajustes
zh_hans: 显示在系统设置中的电池健康数据

# TemporaryNotSupportMessage
source: Oops, although you have installed the App using TrollStore, but the data has not been obtained, and the data interface does not support your device for the time being. We will try to provide an alternative in subsequent versions. It may take some time to wait patiently, and I'm very sorry, you can use other alternatives.
es_es: Vaya, aunque has instalado la App usando TrollStore, no se han obtenido los datos y la interfaz de datos no es compatible con tu dispositivo por el momento. Intentaremos ofrecer una alternativa en versiones posteriores. Puede que tarde un tiempo, ten paciencia. Lo siento mucho, puedes usar otras alternativas.
zh_hans: 糟糕，虽然您已经使用TrollStore安装了App，但是没有获取到数据，数据接口暂时不支持您的设备，我们会尝试在后续版本中提供替代方案。可能需要耐心等待一段时间，非常抱歉，您可以使用其他替代方案。

# ThanksForXiaoboVlog
source: Special thanks to Xiaobovlog Providing ideas for reading battery health data in settings (RootHelper production ideas)
es_es: Agradecimiento especial a Xiaobovlog Por proporcionar ideas para leer datos de salud de la batería en ajustes (ideas de producción de RootHelper)
zh_hans: 特别感谢肖博vlog 提供读取设置中电池健康数据的思路(RootHelper制作思路)

source: <Unknown>
es_es: <Desconocido>
zh_hans: <未获取到>

# UseHistoryRecordToCalculateSettingsBatteryInfoRefreshDate
source: Use history records to calculate the battery health refresh date in the settings
es_es: Usar registros del historial para calcular la fecha de actualización de la salud de la batería en ajustes
zh_hans: 使用历史记录来推算设置中的电池健康数据刷新日期

source: Use System Language
es_es: Usar idioma del sistema
zh_hans: 使用系统语言

source: Version
es_es: Versión
zh_hans: 版本

source: Wireless Charger: %@
es_es: Cargador inalámbrico: %@
zh_hans: 无线充电: %@

source: Yes
es_es: Sí
zh_hans: 是

source: Fixed time 5 minutes
zh_hans: 5分钟

source: Manual
zh_hans: 手动

source: No
zh_hans: 否

source: No Data
zh_hans: 无数据

source: Refresh Data Every Time
zh_hans: 每次数据刷新时

source: Request Refresh Widget
zh_hans: 请求系统刷新小组件状态

# RequestRefreshWidgetMessage
source: The app has requested system to refresh the widget, and the system may not respond to the request immediately. Do not frequently request refresh of widget status, the system may ignore these requests
zh_hans: 已向系统请求刷新小组件，系统可能不会立刻响应该请求，请勿频繁请求刷新小组件状态，系统可能会忽略这些请求

source: Reset Widget SandBox Path
zh_hans: 重置小组件沙盒目录

# ResetWidgetSandboxPathMessage
source: If the widget fails to retrieve data, and cannot refresh beyond 1 day, and the issue is still unresolved after attempting to restart the device, you can try resetting the widget sandbox directory to try to resolve this problem.
zh_hans: 如果发现小组件出现故障，超过1天无法刷新数据，且尝试过重启设备后仍然无法解决，可以尝试重置小组件沙盒目录以尝试解决此问题

# ThanksForDeciBelioS
source: Special thanks to Deci8BelioS Providing Spanish translations for the app
zh_hans: 感谢DeciBelioS提供西班牙语的翻译

# UpdateTime
source: Update: %@
zh_hans: 更新时间: %@

# WidgetAppearanceFooterMessage
source: Widget appearance can be set by long pressing the widget in the home screen, each widget can set the appearance and whether the refresh time is displayed separately.
zh_hans: 小组件外观可在主屏幕中长按小组件设置，每个小组件可单独设置外观和是否显示刷新时间

# WidgetMaximumCapacity
source: Maximum Capacity: %@%%
zh_hans: 电池健康: %@%%

source: Widget Refresh Frequency
zh_hans: 小组件刷新频率

# WidgetRefreshFrequencyFooterMessage
source: The refresh frequency of the widget depends on system scheduling, and the number of refreshes per day is limited. It is recommended to refresh when data changes to save refreshes. If the widget is not refreshed by the system, and you want to refresh the data immediately, you need to reboot device or reboot userspace.
zh_hans: 小组件刷新频率取决于系统调度，且每天刷新次数有限。建议选择数据变化时刷新，节省刷新次数 系统没有刷新小组件情况下，如果希望立刻刷新数据需要重启设备或重启用户空间

source: Widget SandBox Path
zh_hans: 小组件沙盒目录

# WidgetSettings
source: Widget
zh_hans: 小组件
